<html>
<head>
        	<title>PHP-1</title>
</head>

<body>
		<h1>PHP</h1>
		<p>3 урок<br><br></p>
		<p><b><font color="BLUE">1. Напишите программу-калькулятор<br> 1.1. Форма для ввода двух чисел, выбора знака операции и кнопка "равно"</font></b></p>
<?php

// Инициируем переменные
$res = 0;
$f = '';
$s = '';
$o = '';

// Принимаем данные с формы
if (isset($_GET['go'])=='go')
{
  $f = $_GET['first'];
  $s = $_GET['second'];
  $o = $_GET['oper'];

 //Проверка на пустые поля
 if ( $f == '' || $s == '' ||$o == ''){
    echo 'Проверьте правильность заполнения, пустые поля!';
  }else{

    switch($o){ //определяем какая опреация выбрана пользователем и выполняем ее. Результат сохранем в переменную res, чтобы далее вывести ее в нужном месте на странице браузера

    case '+':  //выбрано сложение?
    $res=$f+$s;
    break;

    case '-':  //выбрано вычитание?
    $res=$f-$s;
    break;

    case '*':  //выбрано умножение?
    $res=$f*$s;
    break;

    case '/':  //выбрано деление?
    $res=$f/$s;
    break;
    }
 }
}

?>
<h1>КАЛЬКУЛЯТОР</h1>
<form name="Form1" method="get" action="calc1.php" >

<!-- Рисуем поле ввода первого числа -->
<input type="text" name="first"  value="<?php echo $f; ?>" >     <!-- добавим в value вывод переменной $f - значение первого числа, тогда оно будет отображаться в окне ввода -->

<!-- Рисуем выпадающий список с арифметическими операциями   -->
<select name="oper" size="1" size="1">
<option  selected disabled >Выберите арифмитическую операцию!</option>
<option value="+">+ сложение</option>
<option value="-">- вычитание</option>
<option value="*">* умножение</option>
<option value="/">/ деление</option>
</select>

<!-- Рисуем поле ввода второго  числа -->
<input type="text" name="second"  value="<?php echo $s; ?>">     <!-- добавим в value вывод переменной $s - значение второго числа, тогда оно будет отображаться в окне ввода -->


<!-- Рисуем кнопку "равно" -->
<button type="submit" name="go" value="go" ><b>=</b></button>

<!-- Выводим результат -->

<?php echo $res; ?>


 </form>
 </body>
 </html>