<p>И</p>
<table> //рисуем таблицу для таблицы истинности логической операции И
    <tr>
        <th>0</th> //показываем первую переменную
        <th>0</th> //показываем вторую переменную
        <td><?php echo (int)(false && false);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>0</th> //показываем первую переменную
        <th>1</th> //показываем вторую переменную
        <td><?php echo (int)(false && true);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>1</th> //показываем первую переменную
        <th>0</th> //показываем вторую переменную
        <td><?php echo (int)(true && false);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>1</th> //показываем первую переменную
        <th>1</th> //показываем вторую переменную
        <td><?php echo (int)(true && true);  ?></td> //выводим результат логической операции
    </tr>
</table>
<br>
<p>ИЛИ</p>
<table> //рисуем таблицу для таблицы истинности логической операции ИЛИ
    <tr>
        <th>0</th> //показываем первую переменную
        <th>0</th> //показываем вторую переменную
        <td><?php echo (int)(false || false);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>0</th> //показываем первую переменную
        <th>1</th> //показываем вторую переменную
        <td><?php echo (int)(false || true);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>1</th> //показываем первую переменную
        <th>0</th> //показываем вторую переменную
        <td><?php echo (int)(true || false);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>1</th> //показываем первую переменную
        <th>1</th> //показываем вторую переменную
        <td><?php echo (int)(true || true);  ?></td> //выводим результат логической операции
    </tr>
</table>
<br>
<p>Исключающее ИЛИ</p>
<table> //рисуем таблицу для таблицы истинности логической операции Исключающее ИЛИ
    <tr>
        <th>0</th> //показываем первую переменную
        <th>0</th> //показываем вторую переменную
        <td><?php echo (int)(false xor false);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>0</th> //показываем первую переменную
        <th>1</th> //показываем вторую переменную
        <td><?php echo (int)(false xor true);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>1</th> //показываем первую переменную
        <th>0</th> //показываем вторую переменную
        <td><?php echo (int)(true xor false);  ?></td> //выводим результат логической операции
    </tr>
    <tr>
        <th>1</th> //показываем первую переменную
        <th>1</th> //показываем вторую переменную
        <td><?php echo (int)(true xor true);  ?></td> //выводим результат логической операции
    </tr>
</table>