<?php
//пишу функцию
function discr($a, $b, $c)
{
    return ($b **2 - 4 * $a * $c) ;        //вычисляем дискриминант
}

//тестирую функцию
echo 'a=2, b=10, c=3, Дискриминант='.(discr(2,10,3)); //Проверяю работает ли функция (выводит: a=2, b=10, c=3, Дискриминант=76)
//assert(0 == discr(2,10,3)); //данное утверждение выводит ошибку, что правильно 76 не равно 0 (выводит; Fatal error: Uncaught AssertionError: assert(0 == discr(2, 10, 3)) in C:\OSPanel\domains\php1.local\hw22.php:11 Stack trace: #0 C:\OSPanel\domains\php1.local\hw22.php(11): assert(false, 'assert(0 == dis...') #1 {main} thrown in C:\OSPanel\domains\php1.local\hw22.php on line 11)
assert(76 == discr(2,10,3)); //ошибки нет, утверждение правильное
assert(0 == discr(0,0,0)); //ошибки нет, утверждение правильное

//программа решения квадратного уравнения
//задаем вводные значения
$a = 35;
$b = 2;
$c = 10;

//вызываю функцию вычисления Дискриминанта
$d = discr($a,$b,$c);
echo 'Дискриминант'.$d;
//находим корни
if ($d == 0) {                //проверяем условие если Дискриминант равен 0 - тогда единственный корень
    echo 'Уравнение имеет единственный корень. x1=x2=' . -$b / 2 * $a;  //выводим результат, единственный корень
} elseif ($d > 0) {            //вычисляем корни уравнения, При D > 0 корней — два.
    echo 'В результате вычислений уравненя получилось два корня:';
    ?><br>
<?php
    echo 'x1='.(-$b + sqrt($d)) / (2 * $a); //Выводим результаты вычислений. x1
    ?><br>
<?php
    echo 'x2='.(-$b - sqrt($d)) / (2 * $a); //Выводим результаты вычислений. x2
   } else {
    echo 'Решения нет, так как Дискриминант отрицательный! ';                //корней нет, т.к. Дискриминант отрицательный (возврат, вывол ошибки)
}
//получили:"Решения нет, так как Дискриминант отрицательный!"

//Красиво выведем и проверим еще вариант, с двумя корнями. Задаем вводные значения
?><br><br><br>
<?php
echo 'Квадратное уравнение — это уравнение вида Ax2 + Bx + C = 0, где A, B и C — заданные константы.';
?><br><br>
<?php
echo 'A ='.$a = 2;
?><br>
<?php
echo 'B ='.$b = 35;
?><br>
<?php
echo 'C ='.$c = 10;
?><br><br><p><b><?php echo $a; ?>*x<sup>2</sup> + <?php echo $b; ?>*x + <?php echo $c; ?> = 0</b></p>
<?php

//вызываю функцию вычисления Дискриминанта
$d = discr($a,$b,$c);
echo 'Дискриминант ='.$d;
?><br><br>
<?php
//находим корни
if ($d == 0) {                //проверяем условие если Дискриминант равен 0 - тогда единственный корень
    echo 'Уравнение имеет единственный корень. x1=x2=' . -$b / 2 * $a;  //выводим результат, единственный корень
} elseif ($d > 0) {            //вычисляем корни уравнения, При D > 0 корней — два.
    echo 'В результате вычислений уравненя  получилось два корня:';
    ?><br>
    <?php
    echo 'x1='.(-$b + sqrt($d)) / (2 * $a); //Выводим результаты вычислений. x1
    ?><br>
    <?php
    echo 'x2='.(-$b - sqrt($d)) / (2 * $a); //Выводим результаты вычислений. x2
} else {
    echo 'Решения нет, так как Дискриминант отрицательный! ';                //корней нет, т.к. Дискриминант отрицательный (возврат, вывол ошибки)
}
//получили:"В результате вычислений уравненя получилось два корня:
//x1=-0.29053784215568
//x2=-17.209462157844"


