<html>
<head>
    <title>PHP-1</title>
</head>
<body>
<h1>PHP</h1>
<p>2 урок. 4 задание<br><br></p>

<?php
$name = ['Ирина', 'Андрей', 'Альберт', 'Роман', 'Даша', 'Вячеслав', 'Маша', 'Игорь52']; //"заряжаем" для тестирования массив с именами


function detect($n)
{        //Функция

    $fn = substr($n, -2);            //забираем последний символ для анализа (кодировка UTF-8, поэтому -2)

    if ($fn == 'а' || $fn == 'о' || $fn == 'и' || $fn == 'е' || $fn == 'ё' || $fn == 'э' || $fn == 'ы' || $fn == 'у' || $fn == 'ю' || $fn == 'я') {
        $name = 'женский';
    } elseif ($fn == 'б' || $fn == 'в' || $fn == 'г' || $fn == 'д' || $fn == 'ж' || $fn == 'з' || $fn == 'й' || $fn == 'к' || $fn == 'л' || $fn == 'м' || $fn == 'н' || $fn == 'п' || $fn == 'р' || $fn == 'с' || $fn == 'т' || $fn == 'ф' || $fn == 'х' || $fn == 'ц' || $fn == 'ч' || $fn == 'ш' || $fn == 'щ') {
        $name = 'мужской';
    } else {
        $name = 'null';
    }
    return $name;
}


foreach ($name as $f) {            //перебираем элементы массива
    echo 'Имя: ' . $f . ' Пол, возможно: ' . detect($f) . '<br>'; //вызываем функцию, проверяем работу
}
/*
Результат работы:
Имя: Ирина Пол, возможно: женский
Имя: Андрей Пол, возможно: мужской
Имя: Альберт Пол, возможно: мужской
Имя: Роман Пол, возможно: мужской
Имя: Даша Пол, возможно: женский
Имя: Вячеслав Пол, возможно: мужской
Имя: Маша Пол, возможно: женский
Имя: Игорь52 Пол, возможно: null
*/
?>


</body>

</html>