<html>
       <head>
        	<title>PHP-1</title>

        </head>	
	<body>
		<h1>PHP</h1>
		<p>1 урок<br><br></p>
		<p>1. сервер запустил, были сложности, порт 80 был занят драйвером... </p>
		<p>2. мануал в закладки добавил</p> 

		
			
		<p>3.1. 3/1 -> <?php echo var_dump(3/1);  ?> //в результате арифмитической операции получили целое число 3, тип int  <br></p>
		<p>3.2. 1/3 -> <?php echo var_dump(1/3);  ?> //в результате арифмитической операции получили дробное число 0.33333333333333, тип float  <br></p>
		<p>3.3. '20cats' + 40 -> <?php echo var_dump('20cats' + 40);  ?> //в результате арифмитической операции строка '20cats' приведена к значению 20, поскольку это предопределенный тип, опрация сложения, получили целое число int(60) <br></p>
		<p>3.4. 18%4 -> <?php echo var_dump(18%4);  ?> //деление по модулю, целочисленный остаток от деления 18/4=4,5, т.е 4 <br></p>

		<p>4.1. echo ($a = 2); -> <?php echo ($a = 2);  ?> //выводим в поток операцию присвоения <br></p>
		<p>4.2. $x=($y=12)-8; echo $x; -> <?php $x=($y=12)-8; echo $x;  ?> //выводим в поток значение переменной $x, которое предварительно вычислялось <br></p>
		<p>Вывод: значением выражения присваивания есть само присвоенное значение<br></p>
	

		<p>5.1. 1==1.0 -> <?php echo var_dump(1==1.0);  ?> //после преобразования типов, значения равны. Слева целое число, справа дробное число с запятой <br></p>
		<p>5.2. 1===1.0 -> <?php echo var_dump(1===1.0);  ?> //разные типы, не тождественны <br></p>
		<p>5.3. '02'==2 -> <?php echo var_dump('02'==2);  ?> //после преобразования типов  - равны. Слева строка, справа целое число <br></p>
		<p>5.4. '02'===2 -> <?php echo var_dump('02'===2);  ?> // разные типы, не тождественны<br></p>

		<p>6.1. $x=true xor true -> <?php $x=true xor true; echo var_dump($x);  ?> //переменной присваивается true потому, что операция присваивания имеет больший приоритет, нежели xor <br></p>
		                                                     
       </body>
		
</html>	