<html>
       <head>
        	<title>PHP-1</title>

        </head>	
	<body>
		<h1>PHP</h1>
		<p>2 урок<br><br></p>
		
		<p><b><font color="BLUE">1. Таблица истинности для &&, || и xor:</font></b></p>
		
		<!--При решении первого задания используем знания, полученные на уроке. Поскольку операция выполняются многократно, количество аргументов и возвращаемых значений одинаково,  напишем функцию в которой тип логической опрерации будет определятся при помощи CASE -->
		<!-- Изучаем  как работает операция И  -->
		<table border = "1" >
		
		<thead>
		<tr align="center">
		<th colspan="3">Конъюнкция (&&)</th> <?php $type = '&&'  ?>    <!-- "заряжаем" переменную типа операции -->
		</tr>
		</thead>
		<tr align="center">
		<td>a</td>
		<td>b</td>
		<td>a&&b</td>
		</tr>
		
		<tbody>
		<tr align="center">					<!-- Проверяем как работает операция И с аргументами 0, 0 -->
		<td><?php $a=0; echo $a; ?></td> 	<!-- Присваиваем переменной а 0 -->
		<td><?php $b=0; echo $b; ?></td>	<!-- Присваиваем переменной b 0 -->
		<td>
		<?php   
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает операция И с аргументами 1, 0 -->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной а 1 -->
		<td><?php $b=0; echo $b; ?></td>	<!-- Присваиваем переменной b 0 -->
		<td>
		<?php   
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает операция И с аргументами 0, 1 -->
		<td><?php $a=0; echo $a; ?></td> 	<!-- Присваиваем переменной а 0 -->
		<td><?php $b=1; echo $b; ?></td>	<!-- Присваиваем переменной b 1 -->
		<td>
		<?php   
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>		
		
		
		<tr align="center">					<!-- Проверяем как работает операция И с аргументами 1, 1 -->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной а 1 -->
		<td><?php $b=1; echo $b; ?></td>	<!-- Присваиваем переменной b 1 -->
		<td>
		<?php    
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		</tbody>
		</table>
		<br><br>
		<!-- Изучаем  как работает операция ИЛИ  -->
		<table border = "1" >
		
		<thead>
		<tr align="center">
		<th colspan="3">Дизъюнкция (||)</th> <?php $type = '||'  ?>    <!-- "заряжаем" переменную типа операции -->
		</tr>
		</thead>
		<tr align="center">
		<td>a</td>
		<td>b</td>
		<td>a||b</td>
		</tr>
		
		<tbody>
		<tr align="center">					<!-- Проверяем как работает операция ИЛИ с аргументами 0, 0 -->
		<td><?php $a=0; echo $a; ?></td> 	<!-- Присваиваем переменной а 0 -->
		<td><?php $b=0; echo $b; ?></td>	<!-- Присваиваем переменной b 0 -->
		<td>
		<?php     
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает операция ИЛИ с аргументами 1, 0 -->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной а 1 -->
		<td><?php $b=0; echo $b; ?></td>	<!-- Присваиваем переменной b 0 -->
		<td>
		<?php     
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает операция ИЛИ с аргументами 0, 1 -->
		<td><?php $a=0; echo $a; ?></td> 	<!-- Присваиваем переменной а 0 -->
		<td><?php $b=1; echo $b; ?></td>	<!-- Присваиваем переменной b 1 -->
		<td>
		<?php //$c=($a&&$b); echo $c;    
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>		
		
		
		<tr align="center">					<!-- Проверяем как работает операция ИЛИ с аргументами 1, 1 -->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной а 1 -->
		<td><?php $b=1; echo $b; ?></td>	<!-- Присваиваем переменной b 1 -->
		<td>
		<?php //$c=($a&&$b); echo $c;    
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		</tbody>
		</table>
		
		<br><br>
		
		<!-- Изучаем  как работает операция XOR  -->
		<table border = "1" >
		
		<thead>
		<tr align="center">
		<th colspan="3"> исключа́ющее «ИЛИ»(xor)</th> <?php $type = 'xor'  ?>    <!-- "заряжаем" переменную типа операции -->
		</tr>
		</thead>
		<tr align="center">
		<td>a</td>
		<td>b</td>
		<td>a xor b</td>
		</tr>
		
		<tbody>
		<tr align="center">					<!-- Проверяем как работает операция XOR с аргументами 0, 0 -->
		<td><?php $a=0; echo $a; ?></td> 	<!-- Присваиваем переменной а 0 -->
		<td><?php $b=0; echo $b; ?></td>	<!-- Присваиваем переменной b 0 -->
		<td>
		<?php    
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает операция XOR с аргументами 1, 0 -->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной а 1 -->
		<td><?php $b=0; echo $b; ?></td>	<!-- Присваиваем переменной b 0 -->
		<td>
		<?php     
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает операция XOR с аргументами 0, 1 -->
		<td><?php $a=0; echo $a; ?></td> 	<!-- Присваиваем переменной а 0 -->
		<td><?php $b=1; echo $b; ?></td>	<!-- Присваиваем переменной b 1 -->
		<td>
		<?php    
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>		
		
		
		<tr align="center">					<!-- Проверяем как работает операция XOR с аргументами 1, 1 -->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной а 1 -->
		<td><?php $b=1; echo $b; ?></td>	<!-- Присваиваем переменной b 1 -->
		<td>
		<?php     
		echo operlogic($a,$b,$type); // выводим результат 
		?>
		</td>	
		</tr>
		
		</tbody>
		</table>
		
		
		<!-- Функция  -->
		
		<?php
		function operlogic($x, $y, $oper)
		{
				switch($oper){
				
				CASE '&&':	//выполняем следующий код если $oper равно &&
				
				if($x&&$y){   	//выполняем соответсвующую логическую операцию
				return '1';		//возвращаем 1 если выражение истинно
				}else{
				return '0';		//возвращаем 0 если выражение ложно
				}
				
				break;
				
				CASE '||':
				if($x||$y){   	//выполняем соответсвующую логическую операцию
				return '1';		//возвращаем 1 если выражение истинно
				}else{
				return '0';		//возвращаем 0 если выражение ложно
				}
				break;
				
				CASE 'xor':
				if($x xor $y){   	//выполняем соответсвующую логическую операцию
				return '1';		//возвращаем 1 если выражение истинно
				}else{
				return '0';		//возвращаем 0 если выражение ложно
				}
				break;
				
				}
				
		}
		
		?>
		
		<!-- Код можно было оптмизировать, завциклив повторяющиеся три раза построение таблиц -->
		
		<p><b><font color="BLUE">2. Составьте функцию вычисления дискриминанта квадратного уравнения.</font></b></p> 

		<p>Квадратное уравнение — это уравнение вида Ax2 + Bx + C = 0, где A, B и C — заданные константы (с ограничением A != 0). <br>
		Дискриминант вычисляется как: D = B2-4AC. <br>
		Если D = 0, уравнение имеет единственный действительный корень x = -B/2A, <br>
		в противном случае существует пара корней x1 = (-B+sqrt(D))/2A, x2 = (-B-sqrt(D))/2A </p>
		<?php
		
		function diskr($a, $b, $c)  // переменные a, b. c -константы уравнения, см. выше
		{
		if ($a !=0){				//А  не должно равняться нулю - проверяем условие
		
		$d = $b*$b-4*$a*$c;;   		//вычисляем дискриминант  
        
		if ($d==0) {           		//проверяем условие если Дискриминант равен 0 - тогда единственный корень
            $x1 = $x2 = (-$b)/2*$a;
			echo 'Уравнение имеет единственный корень. x1=x2='.$x1;  //возвращать результат работы таким способом (echo) - плохой тон. Но далее нужно будет вернуть два значения.
        } elseif ($d>0) {			//вычисляем корни уравнения
            $x1 = (-$b+sqrt($d))/(2*$a);
            $x2 = (-$b-sqrt($d))/(2*$a);
			echo 'В результате вычислений уравненя получилось два корня: <br> X1='.$x1.'<br>X2='.$x2;				//Два корня. Выводим результаты вычислений.
			}else{	
				echo'Решения нет, так как Дискриминант отрицательный! ';				//корней нет, т.к. Дискриминант отрицательный (возврат, вывол ошибки)
			}
		}else{
			echo 'Ошибка! По условию квадратного уравнения А не может бытьравно 0!'; 	//выводим ошибку А=0
		}
		}
		?>
		
		<p><b><font color="BLUE">продолжение 2го задания."Покройте ее тестами." </font></b></p> 
		<!-- результаты  входных и выходных значений, для наглядности сведем в таблицу -->
		
		<table border = "1" >
		<thead>
		<tr align="center">
		<th colspan="4"> Тестирование функции вычисления Дискриминанта</th>    <!-- Проверяем как работает функция вычисления Лискриминанта квадратного уравнения -->
		</tr>
		</thead>
		<tr align="center">
		<td>A</td>
		<td>B</td>
		<td>C</td>
		<td>Результат</td>		
		</tr>
		
		<tbody>
	
		<tr align="center">					<!-- Проверяем как работает функция при А=0 -->
		<td><?php $a=0; echo $a; ?></td> 	<!-- Присваиваем переменной A 0 -->
		<td><?php $b=5; echo $b; ?></td>	<!-- Присваиваем переменной B 5 -->
		<td><?php $c=6; echo $c; ?></td>	<!-- Присваиваем переменной C 6 -->
		<td>
		<?php   
		diskr($a,$b,$c); 					// выводим результат, функция отработала корректно, в браузере выведен результат об ошибке А не может быть 0
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает функция при:-->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной A 1 -->
		<td><?php $b=5; echo $b; ?></td>	<!-- Присваиваем переменной B 5 -->
		<td><?php $c=6; echo $c; ?></td>	<!-- Присваиваем переменной C 6 -->
		<td>
		<?php   
		diskr($a,$b,$c); 					// выводим результат, функция отработала корректно, в браузере выведен результат x1=0, x2=-6
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает функция при:-->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной A 1 -->
		<td><?php $b=3; echo $b; ?></td>	<!-- Присваиваем переменной B 3 -->
		<td><?php $c=-4; echo $c; ?></td>	<!-- Присваиваем переменной C -4 -->
		<td>
		<?php   
		diskr($a,$b,$c); 					// выводим результат, функция отработала корректно, в браузере выведен результат x1=0, x2=-6
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает функция при неполном квартном уравнении:-->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной A 1 -->
		<td><?php $b=5; echo $b; ?></td>	<!-- Присваиваем переменной B 5 -->
		<td><?php $c=0; echo $c; ?></td>	<!-- Присваиваем переменной C 0 -->
		<td>
		<?php   
		diskr($a,$b,$c); 					// выводим результат, функция отработала корректно, в браузере выведен результат x1=0, x2=-6
		?>
		</td>	
		</tr>
		
		<tr align="center">					<!-- Проверяем как работает функция при неполном квартном уравнении:-->
		<td><?php $a=1; echo $a; ?></td> 	<!-- Присваиваем переменной A 1 -->
		<td><?php $b=-6; echo $b; ?></td>	<!-- Присваиваем переменной B -6 -->
		<td><?php $c=9; echo $c; ?></td>	<!-- Присваиваем переменной C 9 -->
		<td>
		<?php   
		diskr($a,$b,$c); 					// выводим результат, функция отработала корректно, в браузере выведен результат x1=x2=3
		?>
		</td>	
		</tr>
		
		</tbody>
		</table>
		<!-- Таким образом проверили все варианты решения уравнения -->


		<p><b><font color="BLUE">продолжение 2го задания."Используя эту функцию, напишите программу, которая решает квадратное уравнение. Оформите красивый вывод решения." </font></b></p> 
		<!-- используем форму и метод POST для получения значений переменных А,В,С от пользователя -->
		
		<!-- обрабатываем нажатие кнопки-->
		<?php
		if(isset($_POST['go'])){	//кнопка нажата?
			$a=$_POST['a'];			//принимаем значения введенные пользователм (здесь нужна проверка на коректность введенных данных!!)
			$b=$_POST['b'];
			$c=$_POST['c'];
		?>	
		<p><b>Квадратное уравнение — это уравнение вида Ax2 + Bx + C = 0, подставляем Ваши данные:</b></p>
		<p><b><?php echo $a; ?>*x<sup>2</sup> + <?php echo $b; ?>*x + <?php echo $c; ?> = 0</b></p>
		<p><b>Результат вычислений:</b></p>
		<?php	
			diskr($a,$b,$c);		//вызываем функцию
		}
		
		?>
		
		
		<form method="post" action="index.php" >
		<br>
		<p><b>Задайте переменные для вычисления уравнения:</b></p>
		введите значение А: <input type="text" name ="a" value=""><br>
		введите значение B: <input type="text" name ="b" value=""><br>
		введите значение C: <input type="text" name ="c" value=""><br><br>
		<button type=submit name="go" value="">ВЫЧИСЛИТЬ!</button>
		</form>











		
       </body>
		
</html>	