<?php
//скрипт обработчик добавления новой записи в гостевую книгу
if (isset($_POST['go'])== 'go') {    //кнопка нажата?
    $fio = $_POST['fio'];            //принимаем значения введенные пользователм (здесь нужна проверка на коректность введенных данных!!)
    $sity = $_POST['sity'];
    $phone = $_POST['phone'];

    $lines = file(__DIR__ . '/test.txt'); //читаем файл в массив
    $lines[]= "\r\n".$fio.','.$sity.','.$phone; //добавляем запись  и перевод строки в массив
    file_put_contents(__DIR__ . '/test.txt', $lines); //записываем файл

    exit("<meta http-equiv='refresh' content='0; url=/guest.php'>"); // уходим обратно на главную страницу
}
?>
